{
    "about": "I'm a Computer Science Senior, studying at Seattle Pacific University, and am completing my degree this June. I am passionate about how data flows between different layers in software, and have used that motivation to learn about hosting projects on AWS as well as the concepts of algorithms and backend development. My time at SPU has brought about a multitude of memories, experiences, and life long lessons, setting me up to pursue a full time opportunity this summer and beyond.",
    
    "past": "Computers have held my interest for as long as I could remember. A childhood of videogames and Microsoft Office applications inspired questions of how programs worked, and what it took to make something run. This is where I started at around the age of 13, seeking out basic Udemy tutorials to learn the basics of Unity3D & C#. Though I no longer have any of the game demos that I created back then, I can remember the joys of getting a character to move around on a screen, and working through user input to operate a setting.\nMy interest continued to grow overtime, with a career defining web design class in Sophomore year of High School making me certain that I wanted to pursue this direction. Through open ended projects, my fascination with web development and the flow of data around grew immensely. As I have grown in my journey, I have expenaded my capabilities and known languages throughout four years at SPU, with Algorithms, Software Engineering, and Computer Organization & Assembly all adding to a well rounded understanding of how programs run. As of now, I am finishing up a year long Software Project, with hopes of continuing to work on larger scale projects in order to further gain experience in the Software Development Lifecycle.",
    
    "future": "As I continue to build towards a career in Software Engineering, my focus is on the aformentioned larger projects. I am always excited to see about collaborating on ideas, and would love to hear any that you may want to consider building. I believe that I am best suited for a fullstack / backend position, however I am more than willing to try anything. If you have any questions, or would like to potentially collaborate on something, please reach out!"
}