[
  {
    "name": "Software Engineering Student",
    "duration": "September 2024 - June 2025",
    "location": "Seattle Pacific University",
    "type": "Buildmiser -> Scrum Master | Backend Developer",
    "description": "Worked as a backend engineer on a Senior Project that aimed to make an app to translate between American Sign Language and English (More Info on Projects Tab). Served as Buildmiser for two thirds of the year, and then stepped in as Scrum Master for the remaining third of the year. Grew in problem solving skills, and learned immensely about working to bring a team together for a common developmental goal. Was able to experience working in an Agile Scrum setting, learning about the different roles, and story point allocation for sprint driven development.",
    "skills": ["Agile Scrum", "Team Dynamics", "Software Development Lifecycle", "Leadership", "Communication", "Version Control Management"]
  },
  {
    "name": "Software Engineering Intern",
    "duration": "June 2024 - August 2024",
    "location": "Remote",
    "description": "Assisted with development of bespoke application for JAMB Services, a Project Management Service in the Construction Industry. Practiced communicating within a Software Development Team, and working on key sections of code relating to database retrieveal to send to the front-end. Gained immense practice in the basics of Web Development, as well as professional practices regarding version control.",
    "skills": ["Vue.js", "MongoDB", "Data Formatting Enforcement", "AWS Lambda", "Documentation", "Git"]
  },
  { 
    "name": "Computer Science Lab Assistant", 
    "duration": "January 2023 - Present",
    "location": "Seattle Pacific University",
    "description": "Assisted fellow Computer Science Students in a tutoring environment as they worked on Computer Science related coursework. Discussed methods of debugging code, as well as honed in on various concepts within the introductory coding sequence of classes.", 
    "skills": ["C++", "Data Structures", "Troubleshooting & Debugging", "Tutoring"] 
  }
]
